vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA365_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_random" Cversion="1.0.0" condition="component.sgi_pkc.examples_random.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClRandom/mcuxClRandom_PRNG_Patch_example.c" projectpath="component/sgi_pkc/examples/mcuxClRandom"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClRandom/mcuxClRandom_PRNG_Seed_example.c" projectpath="component/sgi_pkc/examples/mcuxClRandom"/>
        <file category="include" name="components/sgi_pkc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_random_modes" Cversion="1.0.0" condition="component.sgi_pkc.examples_random_modes.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_CtrDrbg_AES256_DRG3_example.c" projectpath="component/sgi_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_CtrDrbg_AES256_DRG4_example.c" projectpath="component/sgi_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_Different_Sessions_example.c" projectpath="component/sgi_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_PatchMode_CtrDrbg_AES256_DRG3_example.c" projectpath="component/sgi_pkc/examples/mcuxClRandomModes"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClRandomModes/mcuxClRandomModes_TestMode_CtrDrbg_AES256_DRG4_example.c" projectpath="component/sgi_pkc/examples/mcuxClRandomModes"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/sgi_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_rsa" Cversion="1.0.0" condition="component.sgi_pkc.examples_rsa.condition_id">
      <description>Component sgi_pkc_test</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClRsa/mcuxClRsa_KeyGeneration_example.c" projectpath="component/sgi_pkc/examples/mcuxClRsa"/>
        <file category="sourceC" name="components/sgi_pkc/examples/mcuxClRsa/mcuxClRsa_Signature_RSASSA_PSS_example.c" projectpath="component/sgi_pkc/examples/mcuxClRsa"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/examples/mcuxCsslFlowProtection/inc/"/>
        <file category="include" name="components/sgi_pkc/examples/mcuxCsslMemory/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClExample/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClBuffer/inc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_ecc_ffdh" Cversion="1.0.0" condition="component.sgi_pkc.ffdh.condition_id">
      <description>Component sgi_pkc.ffdh</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClFfdh/src/mcuxClFfdh_Constants.c" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClFfdh/src/mcuxClFfdh_KeyAgreement.c" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClFfdh/src/mcuxClFfdh_KeyEncodingMechanisms.c" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClFfdh/src/mcuxClFfdh_KeyTypes.c" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClFfdh/src/mcuxClFfdh_PublicKeyLoadAndValidate.c" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClFfdh/src/mcuxClFfdh_SetupEnvironment.c" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClFfdh/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClFfdh/inc/mcuxClFfdh.h" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClFfdh/inc/mcuxClFfdh_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClFfdh/inc/mcuxClFfdh_KeyEncodingMechanisms.h" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClFfdh/inc/mcuxClFfdh_KeyTypes.h" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClFfdh/inc/mcuxClFfdh_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClFfdh/inc/internal/mcuxClFfdh_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/inc/internal" path="components/sgi_pkc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClFfdh/inc/internal/mcuxClFfdh_Internal_PkcDefs.h" projectpath="component/sgi_pkc/src/comps/mcuxClFfdh/inc/internal" path="components/sgi_pkc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClFfdh/inc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection" Cversion="1.0.0" condition="component.sgi_pkc.flow_protection.condition_id">
      <description>Component sgi_pkc flow_protection</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_Cfg.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_FunctionIdentifiers.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_Impl.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_None.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_SecureCounter_Common.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_SecureCounter_Local.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_SecureCounter_Local_AssemblyMacros.h" projectpath="component/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxCsslFlowProtection/inc/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_glikey" Cversion="1.0.0" condition="component.sgi_pkc.glikey.condition_id">
      <description>Component glikey</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClGlikey/src/mcuxClGlikey.c" projectpath="component/sgi_pkc/src/comps/mcuxClGlikey/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClGlikey/inc/mcuxClGlikey.h" projectpath="component/sgi_pkc/src/comps/mcuxClGlikey/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClGlikey/inc/internal/mcuxClGlikey_SfrAccess.h" projectpath="component/sgi_pkc/src/comps/mcuxClGlikey/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClGlikey/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClGlikey/inc/internal/"/>
      </files>
    </component>
