vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA365_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_mac_modes" Cversion="1.0.0" condition="component.sgi_pkc.mac_modes.condition_id">
      <description>Component sgi_pkc.mac_modes</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Common.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Sgi_Cbcmac.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Sgi_Cleanup.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Sgi_Cmac.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Sgi_Cmac_Dma_NonBlocking.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Sgi_Cmac_DmaDriven.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Sgi_Functions.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Sgi_Functions_DmaDriven.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Sgi_Gmac.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Sgi_Helper.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/mcuxClMacModes_Sgi_Modes.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMacModes/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/mcuxClMacModes_Modes.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Memory.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Common_Wa.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Sgi_Algorithms.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Sgi_Cbcmac.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Sgi_Cleanup.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Sgi_Cmac.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Sgi_Ctx.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Sgi_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Sgi_Gmac.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/mcuxClMacModes_Sgi_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClMacModes/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClMacModes/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_math" Cversion="1.0.0" condition="component.sgi_pkc.math.condition_id">
      <description>Component sgi_pkc.math</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_ExactDivide.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_ExactDivideOdd.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_ExactDivideOdd_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_ModExp_SqrMultL2R.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_ModInv.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_ModInv_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_ModSquareRoot.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_NDash.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_NDash_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_QDash.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_QDash_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_ReduceModEven.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_SecModExp.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_SecModExp_FUP.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClMath/src/mcuxClMath_Utils.c" projectpath="component/sgi_pkc/src/comps/mcuxClMath/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/mcuxClMath_ExactDivideOdd_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/mcuxClMath_ModInv_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/mcuxClMath_NDash_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/mcuxClMath_QDash_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/mcuxClMath_SecModExp_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_ExactDivideOdd_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_ExactDivideOdd.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_ModInv.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_ModSquareRoot.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_NDash.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_QDash.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_SecModExp.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_Internal_Utils.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_ModInv_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_NDash_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_QDash_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/mcuxClMath_SecModExp_FUP.h" projectpath="component/sgi_pkc/src/comps/mcuxClMath/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClMath/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClMath/inc/internal/"/>
      </files>
    </component>
