vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA365_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain" Cversion="1.0.0" condition="component.sgi_pkc.toolchain.condition_id">
      <description>Component sgi_pkc toolchain</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/compiler/mcuxClToolchain.h" projectpath="component/sgi_pkc/src/compiler"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/compiler/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_trng" Cversion="1.0.0" condition="component.sgi_pkc.trng.condition_id">
      <description>Component sgi_pkc.trng</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClTrng/src/mcuxClTrng_SA_TRNG.c" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/src"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_SA_TRNG.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_SfrAccess.h" projectpath="component/sgi_pkc/src/comps/mcuxClTrng/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClTrng/inc/internal/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA365_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXA365_cmsis</description>
      <files>
        <file category="header" name="devices/MCXA365/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXA365/MCXA365.h" projectpath="device"/>
        <file category="header" name="devices/MCXA365/MCXA365_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXA365/MCXA365_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_ADC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_AOI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_CAN.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_CDOG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_CMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_CRC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_CTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_DEBUGMAILBOX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_DIGTMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_DMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_EIM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_EQDC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_ERM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_FLEXIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_FMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_FMU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_FREQME.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_GLIKEY.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_GPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_I3C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_INPUTMUX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_LCD.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_LPCMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_LPDAC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_LPI2C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_LPSPI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_LPTMR.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_LPUART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_MAU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_MRCC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_OPAMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_OSTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_PKC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_PORT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_PWM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_RTC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_SCG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_SGI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_SMARTDMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_SPC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_SYSCON.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_TRDC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_TRNG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_UDF.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_USB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_UTICK.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_VBAT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_WAKETIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_WUU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA365/periph2/PERI_WWDT.h" projectpath="device/periph2"/>
        <file category="include" name="devices/MCXA365/"/>
        <file category="include" name="devices/MCXA365/periph2/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA365/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA365/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXA365_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXA365_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA365.condition_id" category="linkerScript" name="devices/MCXA365/arm/MCXA365_flash.scf" projectpath="MCXA365/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA365.condition_id" category="linkerScript" name="devices/MCXA365/arm/MCXA365_ram.scf" projectpath="MCXA365/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA365.condition_id" category="linkerScript" name="devices/MCXA365/gcc/MCXA365_flash.ld" projectpath="MCXA365/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA365.condition_id" category="linkerScript" name="devices/MCXA365/gcc/MCXA365_ram.ld" projectpath="MCXA365/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA365.condition_id" category="linkerScript" name="devices/MCXA365/iar/MCXA365_flash.icf" projectpath="MCXA365/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA365.condition_id" category="linkerScript" name="devices/MCXA365/iar/MCXA365_ram.icf" projectpath="MCXA365/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXA365" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXA365</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA365/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA365/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA365/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA365/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA365/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA365/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA365/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA365/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA365/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXA365_startup</description>
      <files>
        <file condition="allOf.toolchains=armgcc, iar, mdk.condition_id" category="sourceC" attr="config" name="devices/MCXA365/startup_MCXA365.c" version="1.0.0" projectpath="startup"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA365_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXA365_system</description>
      <files>
        <file category="sourceC" name="devices/MCXA365/system_MCXA365.c" projectpath="device"/>
        <file category="header" name="devices/MCXA365/system_MCXA365.h" projectpath="device"/>
        <file category="include" name="devices/MCXA365/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.2" condition="driver.aoi.condition_id">
      <description>AOI Driver</description>
      <files>
        <file category="header" name="devices/MCXA365/drivers/fsl_aoi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA365/drivers/fsl_aoi.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA365/drivers/"/>
      </files>
    </component>
